Z-Wave-Me/Z-Uno-Core/hardware/arduino/zuno/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor
menu.Frequency=Frequency

##############################################################
zuno.name=Z-Wave>ME Z-Uno

zuno.vid.0=0x0658
zuno.pid.0=0x0200
zuno.vid.1=0x0658
zuno.pid.1=0x0000

zuno.upload.tool=zprog
zuno.upload.protocol=usb
zuno.upload.maximum_size=32256
zuno.upload.maximum_data_size=0
zuno.upload.speed=115200

zuno.bootloader.tool=zprog
zuno.bootloader.low_fuses=0xFF
zuno.bootloader.high_fuses=0xDE
zuno.bootloader.extended_fuses=0x05
zuno.bootloader.unlock_bits=0x3F
zuno.bootloader.lock_bits=0x0F
zuno.bootloader.file=none

zuno.build.mcu=zuno
zuno.build.f_cpu=16000000L
zuno.build.board=zuno
zuno.build.core=zuno
zuno.build.variant=
zuno.build.vid=0x2341
zuno.build.pid=0x8039
zuno.build.usb_product="Z-UNO"
zuno.build.extra_flags=

zuno.menu.Frequency.Ru = Russian
zuno.menu.Frequency.Eu = Europe
zuno.menu.Frequency.Us = USA
zuno.menu.Frequency.Ru.build.rf_freq = RU
zuno.menu.Frequency.Eu.build.rf_freq = EU
zuno.menu.Frequency.Us.build.rf_freq = US

